<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"fb2ec4acae6649e5234b2020476818df4de58fd68e0fa5dd29d43aedc7cb4411","plan_job_ref":"Job Plan #4 at https://github.com/ExpidusOS/infra/actions/runs/5884418076","plan_hash":"e85c725c3168b7f7383dd980188f8ca71bc43c3de784246897e1afea5acb50ac","plan_text_format":"text","version":"1.36.1"} -->
Terraform plan in __.__
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.cert-manager will be created
  + resource "helm_release" "cert-manager" {
      + atomic                     = true
      + chart                      = "cert-manager"
      + cleanup_on_fail            = true
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = "cert-manager"
      + pass_credentials           = false
      + recreate_pods              = true
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v1.12.3"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "installCRDs"
          + value = "true"
        }
    }

  # helm_release.gitlab-operator will be created
  + resource "helm_release" "gitlab-operator" {
      + atomic                     = true
      + chart                      = "gitlab-operator"
      + cleanup_on_fail            = true
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "gitlab-operator"
      + namespace                  = "gitlab-system"
      + pass_credentials           = false
      + recreate_pods              = true
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://gitlab.com/api/v4/projects/18899486/packages/helm/stable"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.22.4"
      + wait                       = true
      + wait_for_jobs              = true

      + set {
          + name  = "gitlab.gitaly.persistence.size"
          + value = "10Gi"
        }
    }

  # kubectl_manifest.gitlab will be created
  + resource "kubectl_manifest" "gitlab" {
      + api_version             = "apps.gitlab.com/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "GitLab"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "gitlab"
      + namespace               = "gitlab-system"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apps.gitlab.com/v1beta1
            kind: GitLab
            metadata:
              name: gitlab
              namespace: gitlab-system
            spec:
              chart:
                certmanager-issuer:
                  email: inquiry@midstall.com
                global:
                  appConfig:
                    object_store:
                      connection:
                        secret: gitlab-wasabi-secret
                      enabled: false
                  hosts:
                    domain: gitlab.expidusos.com
                  ingress:
                    configureCertmanager: true
                  minio:
                    enabled: false
                version: 7.2.4
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubernetes_secret.gitlab-wasabi-secret will be created
  + resource "kubernetes_secret" "gitlab-wasabi-secret" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "gitlab-wasabi-secret"
          + namespace        = "gitlab"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [CI #5](https://github.com/ExpidusOS/infra/actions/runs/5884429013)